# running in src/timer_vhdl/src/
plugin -i ghdl
# Analyze all 3 files, elaborate the wrapper
ghdl --std=08 timer.vhd timer.psl timer_wrapper.vhd -e timer_wrapper
prep -top timer_wrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
